# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(data=np.random.randint(low=1,high=5,size=100,dtype='l'))
s2 = pd.Series(data= np.random.randint(low=1,high=4,size=100,dtype='l'))
s3 = pd.Series(data=np.random.randint(low=10000,high=30001,size=100,dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([s1,s2,s3],axis=1)
df.head()

   0  1      2
0  4  1  10566
1  4  2  19230
2  2  3  15737
3  2  2  18683
4  3  2  19852

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)

In [8]:
df.head()

   bedrs  bathrs  price_sqr_meter
0      4       1            10566
1      4       2            19230
2      2       3            15737
3      2       2            18683
4      3       2            19852

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [19]:
bigcolumn = pd.concat([s1,s2,s3],axis=0)
bigcolumn

0         4
1         4
2         2
3         2
4         3
      ...
95    29562
96    28622
97    21008
98    22579
99    28496
Length: 300, dtype: int32

In [20]:
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       4
1       4
2       2
3       2
4       3
..    ...
95  29562
96  28622
97  21008
98  22579
99  28496

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [21]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [22]:
bigcolumn.reset_index(drop=True,inplace=True)

In [23]:
bigcolumn

         0
0        4
1        4
2        2
3        2
4        3
..     ...
295  29562
296  28622
297  21008
298  22579
299  28496

[300 rows x 1 columns]